Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_dramc_type.h
#ifndef RTL8735B_DRAMC_TYPE_H
#define RTL8735B_DRAMC_TYPE_H

#define MS_PCTL_CCR_OFFSET        0x000
#define MS_PCTL_DCR_OFFSET        0x004
#define MS_PCTL_IOCR_OFFSET       0x008
#define MS_PCTL_CSR_OFFSET        0x00c
#define MS_PCTL_DRR_OFFSET        0x010
#define MS_PCTL_TPR0_OFFSET       0x014
#define MS_PCTL_TPR1_OFFSET       0x018
#define MS_PCTL_TPR2_OFFSET       0x01c
#define MS_PCTL_TPR3_OFFSET       0x020

#define MS_PCTL_CDPIN_NDGE_OFFSET 0x024
#define MS_PCTL_CDPIN_OFFSET      0x028
#define MS_PCTL_TDPIN_OFFSET      0x02c

#define MS_PCTL_MRINFO_OFFSET     0x030
#define MS_PCTL_MR0_OFFSET        0x034
#define MS_PCTL_MR1_OFFSET        0x038
#define MS_PCTL_MR2_OFFSET        0x03c
#define MS_PCTL_MR3_OFFSET        0x040
#define MS_PCTL_MR4_OFFSET        0x044
#define MS_PCTL_MR5_OFFSET        0x048
#define MS_PCTL_MR6_OFFSET        0x04c
#define MS_PCTL_MR11_OFFSET       0x050
#define MS_PCTL_MR12_OFFSET       0x054
#define MS_PCTL_MR13_OFFSET       0x058
#define MS_PCTL_MR14_OFFSET       0x05c
#define MS_PCTL_MR22_OFFSET       0x060

#define MS_PCTL_TPR4_OFFSET       0x090
#define MS_PCTL_TPR5_OFFSET       0x094
#define MS_PCTL_DPDRI_OFFSET      0x0c0
#define MS_PCTL_DPDR_OFFSET       0x0c4
#define MS_PCTL_ISR_OFFSET        0x0c8
#define MS_PCTL_IMR_OFFSET        0x0cc

#define MS_PCTL_BCR_OFFSET        0x0d0
#define MS_PCTL_BCT_OFFSET        0x0d4
#define MS_PCTL_BCM_OFFSET        0x0d8
#define MS_PCTL_BST_OFFSET        0x0dc
#define MS_PCTL_BSRAM0_OFFSET     0x0e0
#define MS_PCTL_BSRAM1_OFFSET     0x0e4
#define MS_PCTL_BER_OFFSET        0x0e8
#define MS_PCTL_BEXPC_OFFSET      0x0ec

#define MS_PCTL_SVN_ID_OFFSET     0x0f4
#define MS_PCTL_IDR_OFFSET        0x0f8
#define MS_PCTL_ELR_OFFSET        0x0fc

#define MS_PHY_DLY0               0x100
#define MS_PHY_DLY1_RST           0x104
#define MS_PHY_DLY_CLK            0x108
#define MS_PHY_DLY_ST             0x10c
#define MS_PHY_DLY_NUM            0x110
#define MS_PHY_DTR0               0x114
#define MS_PHY_DTR1               0x118
#define MS_PHY_DTAR               0x11c

#define MS_PCTL_DRAM_INFO         0x120

#define MS_DRAM_SIZE_OFFSET       0x220
#define MS_WRAP_MISC_OFFSET       0x224
#define MS_WRAP_CHOP_BD_OFFSET    0x228

#define MS_WRAP_IDR_OFFSET        0x2a0
#define MS_WRAP_VER_OFFSET        0x2a4

#define MS_PROF_ADDR_OFFSET       0x308
#define MS_PROF_DATA_OFFSET       0x30c
#define MS_SCRAM_ADDR_OFFSET      0x310
#define MS_SCRAM_DATA_OFFSET      0x314

#define MS_ROW_REMAP0_OFFSET      0x400
#define MS_ROW_REMAP1_OFFSET      0x404
#define MS_ROW_REMAP2_OFFSET      0x408
#define MS_BANK_REMAP0_OFFSET     0x40c
#define MS_COLU_REMAP0_OFFSET     0x410
#define MS_COLU_REMAP1_OFFSET     0x414
#define MS_RANK_REMAP0_OFFSET     0x418
#define MS_CH_REMAP0_OFFSET       0x41c
#define MS_BG_REMAP0_OFFSET       0x420

#define MS_SLOT_PARK_OFFSET       0x460
#define MS_SLOT_STARVE_OFFSET     0x464
#define MS_SLOT_CNTR_OFFSET       0x468

#define MS_CBCTL0_OFFSET          0x480
#define MS_CBCTL1_OFFSET          0x484
#define MS_CBSTARVE0_OFFSET       0x488
#define MS_CBSTARVE1_OFFSET       0x48c
#define MS_CBSTARVE2_OFFSET       0x490
#define MS_CBSTARVE3_OFFSET       0x494
#define MS_CBSTARVE4_OFFSET       0x498

#define MS_BANK_SCH_CTRL_OFFSET   0x4a0

#define PCTL_CCR_INIT_BFO          0
#define PCTL_CCR_INIT_BFW          1
#define PCTL_CCR_DTT_BFO           1
#define PCTL_CCR_DTT_BFW           1
#define PCTL_CCR_BTT_BFO           2
#define PCTL_CCR_BTT_BFW           1
#define PCTL_CCR_DPIT_BFO          3
#define PCTL_CCR_DPIT_BFW          1
#define PCTL_CCR_SRXT_BFO          4
#define PCTL_CCR_SRXT_BFW          1
#define PCTL_CCR_FLUSH_FIFO_BFO    8
#define PCTL_CCR_FLUSH_FIFO_BFW    1
#define PCTL_CCR_CR_UPDATE_BFO     31
#define PCTL_CCR_CR_UPDATE_BFW     1

#define PCTL_DCR_DDR_BFO           0
#define PCTL_DCR_DDR_BFW           4
#define PCTL_DCR_DQ_WID_BFO        4
#define PCTL_DCR_DQ_WID_BFW        4
#define PCTL_DCR_DFI_RATE_BFO      8
#define PCTL_DCR_DFI_RATE_BFW      3
#define PCTL_DCR_RANK2_BFO         12
#define PCTL_DCR_RANK2_BFW         1
#define PCTL_DCR_WR_DBI_BFO        16
#define PCTL_DCR_WR_DBI_BFW        1
#define PCTL_DCR_RD_DBI_BFO        17
#define PCTL_DCR_RD_DBI_BFW        1
#define PCTL_DCR_PAR_BFO           18
#define PCTL_DCR_PAR_BFW           1
#define PCTL_DCR_GEAR_DOWN_BFO     19
#define PCTL_DCR_GEAR_DOWN_BFW     1
#define PCTL_DCR_BG2_BFO           21
#define PCTL_DCR_BG2_BFW           1
#define PCTL_DCR_BG_REMAP_BFO      22
#define PCTL_DCR_BG_REMAP_BFW      1
#define PCTL_DCR_ZQC_BFO           30
#define PCTL_DCR_ZQC_BFW           1

#define PCTL_IOCR_ODT_2PINS_BFO    0
#define PCTL_IOCR_ODT_2PINS_BFW    1
#define PCTL_IOCR_CKE_NOP_BFO      1
#define PCTL_IOCR_CKE_NOP_BFW      1
#define PCTL_IOCR_STC_CKE_BFO      2
#define PCTL_IOCR_STC_CKE_BFW      1
#define PCTL_IOCR_STC_ODT_BFO      3
#define PCTL_IOCR_STC_ODT_BFW      1
#define PCTL_IOCR_CMD_2T_EN_BFO    4
#define PCTL_IOCR_CMD_2T_EN_BFW    1
#define PCTL_IOCR_RTW_2T_DIS_BFO   5
#define PCTL_IOCR_RTW_2T_DIS_BFW   1
#define PCTL_IOCR_HALF_CSN_BFO     6
#define PCTL_IOCR_HALF_CSN_BFW     1
#define PCTL_IOCR_RD_PIPE_BFO      8
#define PCTL_IOCR_RD_PIPE_BFW      4
#define PCTL_IOCR_TPHY_WD_BFO      12
#define PCTL_IOCR_TPHY_WD_BFW      5
#define PCTL_IOCR_TPHY_WL_BFO      17
#define PCTL_IOCR_TPHY_WL_BFW      3
#define PCTL_IOCR_TPHY_RD_EN_BFO   20
#define PCTL_IOCR_TPHY_RD_EN_BFW   5
#define PCTL_IOCR_DC_CH1_BFO       27
#define PCTL_IOCR_DC_CH1_BFW       1
#define PCTL_IOCR_ADDR_SHARE_BFO   28
#define PCTL_IOCR_ADDR_SHARE_BFW   1
#define PCTL_IOCR_AC_SHARE_BFO     29
#define PCTL_IOCR_AC_SHARE_BFW     1

#define PCTL_CSR_DPIN_CMD_BFO      0
#define PCTL_CSR_DPIN_CMD_BFW      2
#define PCTL_CSR_MEM_IDLE_BFO      8
#define PCTL_CSR_MEM_IDLE_BFW      1
#define PCTL_CSR_DT_IDLE_BFO       9
#define PCTL_CSR_DT_IDLE_BFW       1
#define PCTL_CSR_BIST_IDLE_BFO     10
#define PCTL_CSR_BIST_IDLE_BFW     1
#define PCTL_CSR_BT_FAIL_BFO       12
#define PCTL_CSR_BT_FAIL_BFW       1
#define PCTL_CSR_DPIN_MOD_BFO      16
#define PCTL_CSR_DPIN_MOD_BFW      3
#define PCTL_CSR_CR_GP_BFO         31
#define PCTL_CSR_CR_GP_BFW         1

#define PCTL_DRR_TRFC_BFO          0
#define PCTL_DRR_TRFC_BFW          7
#define PCTL_DRR_TREF_BFO          8
#define PCTL_DRR_TREF_BFW          16
#define PCTL_DRR_REF_NUM_BFO       24
#define PCTL_DRR_REF_NUM_BFW       4
#define PCTL_DRR_REF_DIS_BFO       28
#define PCTL_DRR_REF_DIS_BFW       1
#define PCTL_DRR_ZQCL_INV_BFO      29
#define PCTL_DRR_ZQCL_INV_BFW      3

#define PCTL_TPR0_TRP_BFO          0
#define PCTL_TPR0_TRP_BFW          4
#define PCTL_TPR0_TRAS_BFO         4
#define PCTL_TPR0_TRAS_BFW         5
#define PCTL_TPR0_TWR_BFO          9
#define PCTL_TPR0_TWR_BFW          4
#define PCTL_TPR0_TRTP_BFO         13
#define PCTL_TPR0_TRTP_BFW         4
#define PCTL_TPR0_TCKE_BFO         17
#define PCTL_TPR0_TCKE_BFW         6
#define PCTL_TPR0_TPD_EN_BFO       23
#define PCTL_TPR0_TPD_EN_BFW       1
#define PCTL_TPR0_TZQCS_BFO        24
#define PCTL_TPR0_TZQCS_BFW        8

#define PCTL_TPR1_TRRD_BFO         0
#define PCTL_TPR1_TRRD_BFW         4
#define PCTL_TPR1_TRC_BFO          4
#define PCTL_TPR1_TRC_BFW          6
#define PCTL_TPR1_TRCD_BFO         10
#define PCTL_TPR1_TRCD_BFW         4
#define PCTL_TPR1_TCCD_BFO         14
#define PCTL_TPR1_TCCD_BFW         3
#define PCTL_TPR1_TWTR_BFO         17
#define PCTL_TPR1_TWTR_BFW         3
#define PCTL_TPR1_TRTW_BFO         20
#define PCTL_TPR1_TRTW_BFW         4
#define PCTL_TPR1_TFAW_BFO         24
#define PCTL_TPR1_TFAW_BFW         5

