Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_dramc_type.h
#define PCTL_TPR2_INIT_REF_NUM_BFO 0
#define PCTL_TPR2_INIT_REF_NUM_BFW 4
#define PCTL_TPR2_TMRD_BFO         4
#define PCTL_TPR2_TMRD_BFW         4
#define PCTL_TPR2_INIT_NS_BFO      8
#define PCTL_TPR2_INIT_NS_BFW      4
#define PCTL_TPR2_INIT_US_BFO      12
#define PCTL_TPR2_INIT_US_BFW      10
#define PCTL_TPR2_INIT_RST_US_BFO  22
#define PCTL_TPR2_INIT_RST_US_BFW  10

#define PCTL_TPR3_TRPAB_PB_BFO     0
#define PCTL_TPR3_TRPAB_PB_BFW     2
#define PCTL_TPR3_TRAS_MSB_BFO     2
#define PCTL_TPR3_TRAS_MSB_BFW     1
#define PCTL_TPR3_TFAW_MSB_BFO     3
#define PCTL_TPR3_TFAW_MSB_BFW     1
#define PCTL_TPR3_DPIN_LAT_BFO     4
#define PCTL_TPR3_DPIN_LAT_BFW     3
#define PCTL_TPR3_TRCD_MSB_BFO     7
#define PCTL_TPR3_TRCD_MSB_BFW     1
#define PCTL_TPR3_TWTR_MSB_BFO     8
#define PCTL_TPR3_TWTR_MSB_BFW     1
#define PCTL_TPR3_TRTW_MSB_BFO     9
#define PCTL_TPR3_TRTW_MSB_BFW     1
#define PCTL_TPR3_TRFC_MSB_BFO     10
#define PCTL_TPR3_TRFC_MSB_BFW     1
#define PCTL_TPR3_TWR_MSB_BFO      11
#define PCTL_TPR3_TWR_MSB_BFW      1
#define PCTL_TPR3_TPPD_BFO         12
#define PCTL_TPR3_TPPD_BFW         2
#define PCTL_TPR3_TCCD_S_BFO       14
#define PCTL_TPR3_TCCD_S_BFW       3
#define PCTL_TPR3_TWTR_S_BFO       17
#define PCTL_TPR3_TWTR_S_BFW       3
#define PCTL_TPR3_TRRD_S_BFO       20
#define PCTL_TPR3_TRRD_S_BFW       4
#define PCTL_TPR3_TCCD_KW_BFO      24
#define PCTL_TPR3_TCCD_KW_BFW      4
#define PCTL_TPR3_TCCD_R_BFO       28
#define PCTL_TPR3_TCCD_R_BFW       4

#define PCTL_CMD_DPIN_NDGE_ADR_BFO   0
#define PCTL_CMD_DPIN_NDGE_ADR_BFW   17
#define PCTL_CMD_DPIN_NDGE_BANK_BFO  17
#define PCTL_CMD_DPIN_NDGE_BANK_BFW  4
#define PCTL_CMD_DPIN_NDGE_WEN_BFO   21
#define PCTL_CMD_DPIN_NDGE_WEN_BFW   1
#define PCTL_CMD_DPIN_NDGE_CAS_BFO   22
#define PCTL_CMD_DPIN_NDGE_CAS_BFW   1
#define PCTL_CMD_DPIN_NDGE_RAS_BFO   23
#define PCTL_CMD_DPIN_NDGE_RAS_BFW   1
#define PCTL_CMD_DPIN_NDGE_CSN_BFO   24
#define PCTL_CMD_DPIN_NDGE_CSN_BFW   1
#define PCTL_CMD_DPIN_NDGE_ACTN_BFO  25
#define PCTL_CMD_DPIN_NDGE_ACTN_BFW  1
#define PCTL_CMD_DPIN_NDGE_PAR_BFO   26
#define PCTL_CMD_DPIN_NDGE_PAR_BFW   1
#define PCTL_CMD_DPIN_NDGE_CSN_1_BFO 31
#define PCTL_CMD_DPIN_NDGE_CSN_1_BFW 1

#define PCTL_CMD_DPIN_ADR_BFO      0
#define PCTL_CMD_DPIN_ADR_BFW      17
#define PCTL_CMD_DPIN_BANK_BFO     17
#define PCTL_CMD_DPIN_BANK_BFW     4
#define PCTL_CMD_DPIN_WEN_BFO      21
#define PCTL_CMD_DPIN_WEN_BFW      1
#define PCTL_CMD_DPIN_CAS_BFO      22
#define PCTL_CMD_DPIN_CAS_BFW      1
#define PCTL_CMD_DPIN_RAS_BFO      23
#define PCTL_CMD_DPIN_RAS_BFW      1
#define PCTL_CMD_DPIN_CSN_BFO      24
#define PCTL_CMD_DPIN_CSN_BFW      1
#define PCTL_CMD_DPIN_ACTN_BFO     25
#define PCTL_CMD_DPIN_ACTN_BFW     1
#define PCTL_CMD_DPIN_PAR_BFO      26
#define PCTL_CMD_DPIN_PAR_BFW      1
#define PCTL_CMD_DPIN_CSN_1_BFO    31
#define PCTL_CMD_DPIN_CSN_1_BFW    1

#define PCTL_TIE_DPIN_RSTN_BFO     0
#define PCTL_TIE_DPIN_RSTN_BFW     1
#define PCTL_TIE_DPIN_CKE_BFO      1
#define PCTL_TIE_DPIN_CKE_BFW      1
#define PCTL_TIE_DPIN_ODT_BFO      2
#define PCTL_TIE_DPIN_ODT_BFW      1
#define PCTL_TIE_DPIN_TEN_BFO      3
#define PCTL_TIE_DPIN_TEN_BFW      1
#define PCTL_TIE_DPIN_ALERTN_BFO   4
#define PCTL_TIE_DPIN_ALERTN_BFW   1
#define PCTL_TIE_DPIN_RSTN_1_BFO   29
#define PCTL_TIE_DPIN_RSTN_1_BFW   1
#define PCTL_TIE_DPIN_CKE_1_BFO    30
#define PCTL_TIE_DPIN_CKE_1_BFW    1
#define PCTL_TIE_DPIN_ODT_1_BFO    31
#define PCTL_TIE_DPIN_ODT_1_BFW    1

#define PCTL_MRINFO_WR_LAT_BFO     0
#define PCTL_MRINFO_WR_LAT_BFW     5
#define PCTL_MRINFO_RD_LAT_BFO     5
#define PCTL_MRINFO_RD_LAT_BFW     5
#define PCTL_MRINFO_ADD_LAT_BFO    10
#define PCTL_MRINFO_ADD_LAT_BFW    5
#define PCTL_MRINFO_TDQSCK_MAX_BFO 15
#define PCTL_MRINFO_TDQSCK_MAX_BFW 5
#define PCTL_MRINFO_NWR_BFO        20
#define PCTL_MRINFO_NWR_BFW        5
#define PCTL_MRINFO_RTP_BFO        25
#define PCTL_MRINFO_RTP_BFW        5

#define PCTL_MR0_BL_BFO            0
#define PCTL_MR0_BL_BFW            3
#define PCTL_MR0_BST_TYPE_BFO      3
#define PCTL_MR0_BST_TYPE_BFW      1
#define PCTL_MR0_CAS_BFO           4
#define PCTL_MR0_CAS_BFW           3
#define PCTL_MR0_WR_BFO            9
#define PCTL_MR0_WR_BFW            3

#define PCTL_MR1_DLL_EN_BFO        0
#define PCTL_MR1_DLL_EN_BFW        1
#define PCTL_MR1_BL_BFO            0
#define PCTL_MR1_BL_BFW            3
#define PCTL_MR1_ADD_LAT_BFO       3
#define PCTL_MR1_ADD_LAT_BFW       2
#define PCTL_MR1_WR_LP23_BFO       5
#define PCTL_MR1_WR_LP23_BFW       3
#define PCTL_MR1_WR_LP4_BFO        4
#define PCTL_MR1_WR_LP4_BFW        3
#define PCTL_MR1_RTT_NORM_EN_BFO   8
#define PCTL_MR1_RTT_NORM_EN_BFW   3

#define PCTL_MR2_CAS_BFO           0
#define PCTL_MR2_CAS_BFW           4
#define PCTL_MR2_CWL_BFO           3
#define PCTL_MR2_CWL_BFW           3
#define PCTL_MR2_DYC_ODT_EN_BFO    9
#define PCTL_MR2_DYC_ODT_EN_BFW    2

#define PCTL_TPR4_TRP_MSB_BFO      0
#define PCTL_TPR4_TRP_MSB_BFW      1

#define PCTL_TPR5_ODT_HOLD_BFO     0
#define PCTL_TPR5_ODT_HOLD_BFW     5
#define PCTL_TPR5_ODT_DLY_BFO      8
#define PCTL_TPR5_ODT_DLY_BFW      2

#define PCTL_BCR_STOP_BFO          0
#define PCTL_BCR_STOP_BFW          1
#define PCTL_BCR_CMP_BFO           1
#define PCTL_BCR_CMP_BFW           1
#define PCTL_BCR_LOOP_BFO          2
#define PCTL_BCR_LOOP_BFW          1
#define PCTL_BCR_DIS_MASK_BFO      3
#define PCTL_BCR_DIS_MASK_BFW      1
#define PCTL_BCR_AT_STOP_BFO       4
#define PCTL_BCR_AT_STOP_BFW       1
#define PCTL_BCR_CRR_BFO           5
#define PCTL_BCR_CRR_BFW           1
#define PCTL_BCR_FLUSH_CMD_BFO     8
#define PCTL_BCR_FLUSH_CMD_BFW     1
#define PCTL_BCR_FLUSH_WD_BFO      9
#define PCTL_BCR_FLUSH_WD_BFW      1
#define PCTL_BCR_FLUSH_RGD_BFO     10
#define PCTL_BCR_FLUSH_RGD_BFW     1
#define PCTL_BCR_FLUSH_RD_BFO      11
#define PCTL_BCR_FLUSH_RD_BFW      1
#define PCTL_BCR_RELOAD_CMD_BFO    12
#define PCTL_BCR_RELOAD_CMD_BFW    1
#define PCTL_BCR_RELOAD_WD_BFO     13
#define PCTL_BCR_RELOAD_WD_BFW     1
#define PCTL_BCR_RELOAD_RGD_BFO    14
#define PCTL_BCR_RELOAD_RGD_BFW    1
#define PCTL_BCR_RD_EXPC_BFO       16
#define PCTL_BCR_RD_EXPC_BFW       14

