Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_dramc_type.h
#define PCTL_BST_ERR_FST_TH_BFO    0
#define PCTL_BST_ERR_FST_TH_BFW    12
#define PCTL_BST_ERR_CNT_BFO       16
#define PCTL_BST_ERR_CNT_BFW       14

#define PCTL_BSRAM0_CMD_LEVEL_BFO  0
#define PCTL_BSRAM0_CMD_LEVEL_BFW  12
#define PCTL_BSRAM0_WD_LEVEL_BFO   16
#define PCTL_BSRAM0_WD_LEVEL_BFW   14

#define PCTL_BSRAM1_RG_LEVEL_BFO   0
#define PCTL_BSRAM1_RG_LEVEL_BFW   14
#define PCTL_BSRAM1_RD_LEVEL_BFO   16
#define PCTL_BSRAM1_RD_LEVEL_BFW   14

#define WRAP_MISC_PAGE_SIZE_BFO    0
#define WRAP_MISC_PAGE_SIZE_BFW    4
#define WRAP_MISC_BANK_SIZE_BFO    4
#define WRAP_MISC_BANK_SIZE_BFW    2
#define WRAP_MISC_BST_SIZE_BFO     6
#define WRAP_MISC_BST_SIZE_BFW     3
#define WRAP_MISC_HYBR_SIZE_BFO    10
#define WRAP_MISC_HYBR_SIZE_BFW    2

#define WRAP_CHOP_SIZE_BFO         0
#define WRAP_CHOP_SIZE_BFW         3

// vivian add for rxi316
#define ADDR_ROW0_REMAP_BFO     0
#define ADDR_ROW0_REMAP_BFW     4
#define ADDR_ROW1_REMAP_BFO     4
#define ADDR_ROW1_REMAP_BFW     4
#define ADDR_ROW2_REMAP_BFO     8
#define ADDR_ROW2_REMAP_BFW     4
#define ADDR_ROW3_REMAP_BFO     12
#define ADDR_ROW3_REMAP_BFW     4
#define ADDR_ROW4_REMAP_BFO     16
#define ADDR_ROW4_REMAP_BFW     4
#define ADDR_ROW5_REMAP_BFO     20
#define ADDR_ROW5_REMAP_BFW     4
#define ADDR_ROW6_REMAP_BFO     24
#define ADDR_ROW6_REMAP_BFW     4
#define ADDR_ROW7_REMAP_BFO     28
#define ADDR_ROW7_REMAP_BFW     4
#define ADDR_ROW8_REMAP_BFO     0
#define ADDR_ROW8_REMAP_BFW     4
#define ADDR_ROW9_REMAP_BFO     4
#define ADDR_ROW9_REMAP_BFW     4
#define ADDR_ROW10_REMAP_BFO    8
#define ADDR_ROW10_REMAP_BFW    4
#define ADDR_ROW11_REMAP_BFO    12
#define ADDR_ROW11_REMAP_BFW    4
#define ADDR_ROW12_REMAP_BFO    16
#define ADDR_ROW12_REMAP_BFW    4
#define ADDR_ROW13_REMAP_BFO    20
#define ADDR_ROW13_REMAP_BFW    4
#define ADDR_ROW14_REMAP_BFO    24
#define ADDR_ROW14_REMAP_BFW    4
#define ADDR_ROW15_REMAP_BFO    28
#define ADDR_ROW15_REMAP_BFW    4
#define ADDR_ROW16_REMAP_BFO    0
#define ADDR_ROW16_REMAP_BFW    4

#define ADDR_BANK0_REMAP_BFO    0
#define ADDR_BANK0_REMAP_BFW    5
#define ADDR_BANK1_REMAP_BFO    5
#define ADDR_BANK1_REMAP_BFW    5
#define ADDR_BANK2_REMAP_BFO    10
#define ADDR_BANK2_REMAP_BFW    5

#define ADDR_COLU2_REMAP_BFO    0
#define ADDR_COLU2_REMAP_BFW    4
#define ADDR_COLU3_REMAP_BFO    4
#define ADDR_COLU3_REMAP_BFW    4
#define ADDR_COLU4_REMAP_BFO    8
#define ADDR_COLU4_REMAP_BFW    4
#define ADDR_COLU5_REMAP_BFO    12
#define ADDR_COLU5_REMAP_BFW    4
#define ADDR_COLU6_REMAP_BFO    16
#define ADDR_COLU6_REMAP_BFW    4
#define ADDR_COLU7_REMAP_BFO    20
#define ADDR_COLU7_REMAP_BFW    4
#define ADDR_COLU8_REMAP_BFO    24
#define ADDR_COLU8_REMAP_BFW    4
#define ADDR_COLU9_REMAP_BFO    28
#define ADDR_COLU9_REMAP_BFW    4
#define ADDR_COLU10_REMAP_BFO   0
#define ADDR_COLU10_REMAP_BFW   4
#define ADDR_COLU11_REMAP_BFO   4
#define ADDR_COLU11_REMAP_BFW   4

#define ADDR_RANK_REMAP_BFO     0
#define ADDR_RANK_REMAP_BFW     5
#define ADDR_CH_REMAP_BFO       0
#define ADDR_CH_REMAP_BFW       5
#define ADDR_BG0_REMAP_BFO      0
#define ADDR_BG0_REMAP_BFW      5
#define ADDR_BG1_REMAP_BFO      5
#define ADDR_BG1_REMAP_BFW      5

// vivian add for rxi316 performance tuning
#define SLOT_PERF_PARK_BFO            0
#define SLOT_PERF_PARK_BFW            1
#define SLOT_IDLE_WINDOW_BFO          16
#define SLOT_IDLE_WINDOW_BFW          16

#define SLOT_LPW_STARVE_CYC_BFO       0
#define SLOT_LPW_STARVE_CYC_BFW       8
#define SLOT_HPR_STARVE_CYC_BFO       8
#define SLOT_HPR_STARVE_CYC_BFW       8
#define SLOT_LPR_STARVE_CYC_BFO       16
#define SLOT_LPR_STARVE_CYC_BFW       8
#define SLOT_BASE_STARVE_CYC_BFO      24
#define SLOT_BASE_STARVE_CYC_BFW      8

#define SLOT_LPW_IUS_LMT_BFO          0
#define SLOT_LPW_IUS_LMT_BFW          8
#define SLOT_HPR_IUS_LMT_BFO          8
#define SLOT_HPR_IUS_LMT_BFW          8
#define SLOT_LPR_IUS_LMT_BFO          16
#define SLOT_LPR_IUS_LMT_BFW          8

#define CBCTL0_LPR_FREESLOT_NUM_BFO   0
#define CBCTL0_LPR_FREESLOT_NUM_BFW   7
#define CBCTL0_LPR_RMW_RUN_LEN_BFO    16
#define CBCTL0_LPR_RMW_RUN_LEN_BFW    4

#define CBCTL1_DIS_WMG_BFO            0
#define CBCTL1_DIS_WMG_BFW            1
#define CBCTL1_PAGEOPEN_BFO           1
#define CBCTL1_PAGEOPEN_BFW           1
#define CBCTL1_WMG_NUM_THRESHOLD_BFO  8
#define CBCTL1_WMG_NUM_THRESHOLD_BFW  4
#define CBCTL1_LPW_RMW_RUN_LEN_BFO    16
#define CBCTL1_LPW_RMW_RUN_LEN_BFW    4

#define BANK_SCH_BA_SEL_LMT_BFO       0
#define BANK_SCH_BA_SEL_LMT_BFW       4
#define BANK_SCH_BG_SEL_LMT_BFO       4
#define BANK_SCH_BG_SEL_LMT_BFW       4
#define BANK_SCH_RA_SEL_LMT_BFO       8
#define BANK_SCH_RA_SEL_LMT_BFW       4

//----------------BSTC-----------------//
#define PCTL_BCR_STOP_BFO          0
#define PCTL_BCR_STOP_BFW          1
#define PCTL_BCR_CMP_BFO           1
#define PCTL_BCR_CMP_BFW           1
#define PCTL_BCR_LOOP_BFO          2
#define PCTL_BCR_LOOP_BFW          1
#define PCTL_BCR_DIS_MASK_BFO      3
#define PCTL_BCR_DIS_MASK_BFW      1
#define PCTL_BCR_AT_STOP_BFO       4
#define PCTL_BCR_AT_STOP_BFW       1
#define PCTL_BCR_CRR_BFO           5
#define PCTL_BCR_CRR_BFW           1
#define PCTL_BCR_HW_PAT_BFO        7
#define PCTL_BCR_HW_PAT_BFW        1
//#define PCTL_BCR_FLUSH_CMD_BFO     8
//#define PCTL_BCR_FLUSH_CMD_BFW     1
//#define PCTL_BCR_FLUSH_WD_BFO      9
//#define PCTL_BCR_FLUSH_WD_BFW      1
//#define PCTL_BCR_FLUSH_RGD_BFO     10
//#define PCTL_BCR_FLUSH_RGD_BFW     1
//#define PCTL_BCR_FLUSH_RD_BFO      11
//#define PCTL_BCR_FLUSH_RD_BFW      1
#define PCTL_BCR_RELOAD_BFO        12
#define PCTL_BCR_RELOAD_BFW        3
#define PCTL_BCR_FLUSH_RD_EXPC_BFO 16
#define PCTL_BCR_FLUSH_RD_EXPC_BFW 14

#define PCTL_BST_ERR_FST_TH_BFO    0
#define PCTL_BST_ERR_FST_TH_BFW    12
#define PCTL_BST_ERR_CNT_BFO       16
#define PCTL_BST_ERR_CNT_BFW       14

#define PCTL_BSRAM0_CMD_LEVEL_BFO  0
#define PCTL_BSRAM0_CMD_LEVEL_BFW  12
#define PCTL_BSRAM0_WD_LEVEL_BFO   16
#define PCTL_BSRAM0_WD_LEVEL_BFW   14

#define PCTL_BSRAM1_RG_LEVEL_BFO   0
#define PCTL_BSRAM1_RG_LEVEL_BFW   14
#define PCTL_BSRAM1_RD_LEVEL_BFO   16
#define PCTL_BSRAM1_RD_LEVEL_BFW   14

#define PCTL_BEXPR_CMD_EXPC_BFO 0
#define PCTL_BEXPR_CMD_EXPC_BFW 8
#define PCTL_BEXPR_WD_EXPC_BFO  8
#define PCTL_BEXPR_WD_EXPC_BFW  14

