Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_dramc_type.h
typedef struct {
	volatile unsigned int ccr;           /* 0x000 */
	volatile unsigned int dcr;           /* 0x004 */
	volatile unsigned int iocr;          /* 0x008 */
	volatile unsigned int csr;           /* 0x00c */
	volatile unsigned int drr;           /* 0x010 */
	volatile unsigned int tpr0;          /* 0x014 */
	volatile unsigned int tpr1;          /* 0x018 */
	volatile unsigned int tpr2;          /* 0x01c */
	volatile unsigned int tpr3;          /* 0x020 */
	volatile unsigned int cdpin_ndge;    /* 0x024 */
	volatile unsigned int cdpin;         /* 0x028 */
	volatile unsigned int tdpin;         /* 0x02c */
	volatile unsigned int mrinfo;        /* 0x030 */
	volatile unsigned int mr0;           /* 0x034 */
	volatile unsigned int mr1;           /* 0x038 */
	volatile unsigned int mr2;           /* 0x03c */
	volatile unsigned int mr3;           /* 0x040 */
	volatile unsigned int mr4;           /* 0x044 */
	volatile unsigned int mr5;           /* 0x048 */
	volatile unsigned int mr6;           /* 0x04c */
	volatile unsigned int mr11;          /* 0x050 */
	volatile unsigned int mr12;          /* 0x054 */
	volatile unsigned int mr13;          /* 0x058 */
	volatile unsigned int mr14;          /* 0x05c */
	volatile unsigned int mr22;          /* 0x060 */
	volatile unsigned int reserved0[11]; /* 0x064 - 0x08c */
	volatile unsigned int tpr4;          /* 0x090 */
	volatile unsigned int tpr5;          /* 0x094 */
	volatile unsigned int reserved1[10]; /* 0x098 - 0x0bc */
	volatile unsigned int dpdri;         /* 0x0c0 */
	volatile unsigned int dpdr;          /* 0x0c4 */
	volatile unsigned int isr;           /* 0x0c8 */
	volatile unsigned int imr;           /* 0x0cc */
	volatile unsigned int bcr;           /* 0x0d0 */
	volatile unsigned int bct;           /* 0x0d4 */
	volatile unsigned int bcm;           /* 0x0d8 */
	volatile unsigned int bst;           /* 0x0dc */
	volatile unsigned int bsram0;        /* 0x0e0 */
	volatile unsigned int bsram1;        /* 0x0e4 */
	volatile unsigned int ber;           /* 0x0e8 */
	volatile unsigned int bexpc;         /* 0x0ec */
	volatile unsigned int reserved2[1];  /* 0x0f0 */
	volatile unsigned int pctl_svn_id;   /* 0x0f4 */
	volatile unsigned int pctl_idr;      /* 0x0f8 */
	volatile unsigned int err;           /* 0x0fc */
	volatile unsigned int reserved3[73];
	// WRAP CONTROL REGISTER
	volatile unsigned int misc;          /* 0x224 */
	volatile unsigned int wrap_chop_bd;  /* 0x228 */
	volatile unsigned int reserved4[1];  /* 0x22c */
	volatile unsigned int dram_size;     /* 0x230 */
	volatile unsigned int reserved5[27]; /* 0x234 - 0x29c */
	volatile unsigned int wrap_idr;      /* 0x2a0 */
	volatile unsigned int wrap_svn;      /* 0x2a4 */
	volatile unsigned int reserved6[22];
	volatile unsigned int sch_index;     /* 0x300 */
	volatile unsigned int sch_data;      /* 0x304 */
	volatile unsigned int prof_addr;     /* 0x308 */
	volatile unsigned int prof_data;     /* 0x30c */
	volatile unsigned int reserved7[60];

	// vivian add for rxi316
	// ADDR REMAP REGISTER
	volatile unsigned int  row_remap0;   /* 0x400 */
	volatile unsigned int  row_remap1;   /* 0x404 */
	volatile unsigned int  row_remap2;   /* 0x408 */
	volatile unsigned int  bank_remap0;  /* 0x40c */
	volatile unsigned int  colu_remap0;  /* 0x410 */
	volatile unsigned int  colu_remap1;  /* 0x414 */
	volatile unsigned int  rank_remap0;  /* 0x418 */
	volatile unsigned int  ch_remap0;    /* 0x41c */
	volatile unsigned int  bg_remap0;    /* 0x420 */

	// add for rxi316 performance tuning
	volatile unsigned int  reserved8[15];/* 0x424 - 0x45c */
	volatile unsigned int  slot_park;    /* 0x460 */
	volatile unsigned int  slot_starve;  /* 0x464 */
	volatile unsigned int  slot_cntr;    /* 0x468 */
	volatile unsigned int  reserved9[5]; /* 0x46c - 0x47c */
	volatile unsigned int  cbctl0;       /* 0x480 */
	volatile unsigned int  cbctl1;       /* 0x484 */
	volatile unsigned int  cbstarve0;    /* 0x488 */
	volatile unsigned int  cbstarve1;    /* 0x48c */
	volatile unsigned int  cbstarve2;    /* 0x490 */
	volatile unsigned int  cbstarve3;    /* 0x494 */
	volatile unsigned int  cbstarve4;    /* 0x498 */
	volatile unsigned int  reserved10[1];/* 0x49c */
	volatile unsigned int  bank_sch_ctrl;/* 0x4a0 */
} DRAMC_TypeDef; //ms_rxi316_portmap

typedef struct  {
	volatile unsigned int  reserved17[64];
	volatile unsigned int  cm_fe_pa_0;  /* 0x1100 */
	volatile unsigned int  cm_fe_rrb_0;  /* 0x1104 */
	volatile unsigned int  reserved11[446];
	volatile unsigned int  pn_rqos_0;/* 0x1800 + n*0x40 */
	volatile unsigned int  pn_wqos_0;/* 0x1804 + n*0x40  */
	volatile unsigned int  pn_timeout_0;/* 0x1808 + n*0x40  */
	volatile unsigned int  pn_rdqueue_0;/* 0x180C + n*0x40  */
	volatile unsigned int  pn_expiryl_0;/* 0x1810 + n*0x40  */
	volatile unsigned int  pn_expiryh_0;/* 0x1814 + n*0x40  */
	volatile unsigned int  pn_portctrl_0;/* 0x1818 + n*0x40  */
	volatile unsigned int  reserved12[9];
	volatile unsigned int  pn_rqos_1;/* 0x1800 + n*0x40 */
	volatile unsigned int  pn_wqos_1;/* 0x1804 + n*0x40  */
	volatile unsigned int  pn_timeout_1;/* 0x1808 + n*0x40  */
	volatile unsigned int  pn_rdqueue_1;/* 0x180C + n*0x40  */
	volatile unsigned int  pn_expiryl_1;/* 0x1810 + n*0x40  */
	volatile unsigned int  pn_expiryh_1;/* 0x1814 + n*0x40  */
	volatile unsigned int  pn_portctrl_1;/* 0x1818 + n*0x40  */
	volatile unsigned int  reserved13[9];
	volatile unsigned int  pn_rqos_2;/* 0x1800 + n*0x40 */
	volatile unsigned int  pn_wqos_2;/* 0x1804 + n*0x40  */
	volatile unsigned int  pn_timeout_2;/* 0x1808 + n*0x40  */
	volatile unsigned int  pn_rdqueue_2;/* 0x180C + n*0x40  */
	volatile unsigned int  pn_expiryl_2;/* 0x1810 + n*0x40  */
	volatile unsigned int  pn_expiryh_2;/* 0x1814 + n*0x40  */
	volatile unsigned int  pn_portctrl_2;/* 0x1818 + n*0x40  */
	volatile unsigned int  reserved14[9];
	volatile unsigned int  pn_rqos_3;/* 0x1800 + n*0x40 */
	volatile unsigned int  pn_wqos_3;/* 0x1804 + n*0x40  */
	volatile unsigned int  pn_timeout_3;/* 0x1808 + n*0x40  */
	volatile unsigned int  pn_rdqueue_3;/* 0x180C + n*0x40  */
	volatile unsigned int  pn_expiryl_3;/* 0x1810 + n*0x40  */
	volatile unsigned int  pn_expiryh_3;/* 0x1814 + n*0x40  */
	volatile unsigned int  pn_portctrl_3;/* 0x1818 + n*0x40  */
	volatile unsigned int  reserved15[9];
	volatile unsigned int  pn_rqos_4;/* 0x1800 + n*0x40 */
	volatile unsigned int  pn_wqos_4;/* 0x1804 + n*0x40  */
	volatile unsigned int  pn_timeout_4;/* 0x1808 + n*0x40  */
	volatile unsigned int  pn_rdqueue_4;/* 0x180C + n*0x40  */
	volatile unsigned int  pn_expiryl_4;/* 0x1810 + n*0x40  */
	volatile unsigned int  pn_expiryh_4;/* 0x1814 + n*0x40  */
	volatile unsigned int  pn_portctrl_4;/* 0x1818 + n*0x40  */
	volatile unsigned int  reserved16[9];
	volatile unsigned int  pn_rqos_5;/* 0x1800 + n*0x40 */
	volatile unsigned int  pn_wqos_5;/* 0x1804 + n*0x40  */
	volatile unsigned int  pn_timeout_5;/* 0x1808 + n*0x40  */
	volatile unsigned int  pn_rdqueue_5;/* 0x180C + n*0x40  */
	volatile unsigned int  pn_expiryl_5;/* 0x1810 + n*0x40  */
	volatile unsigned int  pn_expiryh_5;/* 0x1814 + n*0x40  */
	volatile unsigned int  pn_portctrl_5;/* 0x1818 + n*0x40  */
} DRAM_FE_TypeDef; //ms_rxi316_ft_portmap

#endif // RTL8735B_DRAMC_TYPE_H

